fa-xbrl/src/InformationRegisters/velpo_CounterpartyData/velpo_CounterpartyData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>velpo_CounterpartyData</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ConsolidatedRating</name>
    <type>
      <types>EnumRef.velpo_ConsolidatedRatings</types>
    </type>
  </resources>
  <resources>
    <name>CreditQualityGroup</name>
    <type>
      <types>EnumRef.velpo_CreditQualityGroups</types>
    </type>
  </resources>
  <resources>
    <name>CreditRating</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>RatingAgency</name>
    <type>
      <types>EnumRef.velpo_RatingAgencies</types>
    </type>
  </resources>
  <resources>
    <name>Risk2Category</name>
    <type>
      <types>EnumRef.velpo_Risk2Categories</types>
    </type>
  </resources>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.velpo_Economic</types>
    </type>
  </attributes>
  <attributes>
    <name>ObjectType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_DimensionIDTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.velpo_BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ObjectID</name>
    <type>
      <types>Characteristic.velpo_DimensionIDTypes</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fa-xbrl/src/InformationRegisters/velpo_UnloadIdentificators/velpo_UnloadIdentificators.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>velpo_UnloadIdentificators</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Identificator</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ObjectID</name>
    <type>
      <types>Characteristic.velpo_DimensionIDTypes</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fa-xbrl/src/InformationRegisters/velpo_ObjectProperties/velpo_ObjectProperties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>velpo_ObjectProperties</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.velpo_ObjectAttributes</types>
    </type>
  </resources>
  <dimensions>
    <name>ObjectID</name>
    <type>
      <types>Characteristic.velpo_DimensionIDTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Attribute</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ObjectAttributes</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fa-xbrl/src/InformationRegisters/velpo_CounterpartyData/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// FA-XBRL, Bookkeeping and XBRL proccessor
//
// @author: Paul Tarasov
//	@email: paul.tarasov@velpo.ru
// 
// Copyright (c) 2021 Paul Tarasov (Velpo)
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
 
Function GetStructure() Export

	// import
	ClientServer = velpo_ClientServer; 
	                       
	Return ClientServer.GetCounterpartyDataStructure(); 	

EndFunction // GetItemStructure()

Function GetQueryText(AccountStructure, OnlyData = False) Export
	
	QueryText =
	"SELECT
	|	CounterpartyData.Period AS Period,
	|	CounterpartyData.BusinessUnit AS BusinessUnit,
	|	CounterpartyData.ObjectID AS ObjectID,
	|	CounterpartyData.ConsolidatedRating AS ConsolidatedRating,
	|	CounterpartyData.CreditQualityGroup AS CreditQualityGroup,
	|	CounterpartyData.CreditRating AS CreditRating,
	|	CounterpartyData.RatingAgency AS RatingAgency,
	|	CounterpartyData.Risk2Category AS Risk2Category,
	|	CounterpartyData.Account AS Account,
	|	CounterpartyData.Status AS Status
	|	//{FIELDS}
	|FROM
	|	InformationRegister.velpo_CounterpartyData AS CounterpartyData
	|	//{JOIN}
	|//{WHERE} CounterpartyData.Period = &Period AND CounterpartyData.BusinessUnit = &BusinessUnit
	|";
	
	If OnlyData Then
		Return QueryText;
	EndIf;
	
	Fields = "";
	Join = "";
	
	For Each PropertyName In AccountStructure.Properties Do
		PropertyData = AccountStructure[PropertyName];
		
		If PropertyData.IsCalculation Then
			Continue;
		EndIf;
		
		TableName = "Table_" + PropertyName;
		
		If PropertyData.IsUnload Then
			Fields = Fields + ",
			|" + TableName + "." + PropertyName + " AS " + PropertyName;
			Join = Join + 
			"LEFT JOIN  InformationRegister.velpo_UnloadIdentificators.SliceLast AS " + TableName + "
			|ON CounterpartyData.ObjectID = " + TableName + ".ObjectID
			|";
		Else
			Fields = Fields + ",
			|" + TableName + ".Value AS " + PropertyName;
			Join = Join + 
			"LEFT JOIN  InformationRegister.velpo_ObjectProperties.SliceLast AS " + TableName + "
			|ON CounterpartyData.ObjectID = " + TableName + ".ObjectID
			|	AND " + TableName + ".Attribute = VALUE(ChartOfCharacteristicTypes.velpo_ObjectAttributes." + PropertyName + ")
			|";
		EndIf;
		
	EndDo; 
		
	QueryText = StrReplace(QueryText, "//{FIELDS}", Fields);
	QueryText = StrReplace(QueryText, "//{JOIN}", Join);

	Return QueryText;
	
EndFunction // GetCounterpartyDataQueryText()

Function GetFieldValue(RowStructure, Name, Period) Export
	
	 // import
	Economic = ChartsOfAccounts.velpo_Economic;
	CounterpartyData = InformationRegisters.velpo_CounterpartyData;
	ObjectProperties = InformationRegisters.velpo_ObjectProperties;
	UnloadIdentificators = InformationRegisters.velpo_UnloadIdentificators;
	Server = velpo_Server; 

	Value = Undefined;
	
	If RowStructure.Property(Name, Value) Then
		Return Value;
	EndIf;
	
	// vars
	AccountStructure = Economic.GetAccountData(RowStructure.Account);
	Attribute = Undefined;
	
	If Not AccountStructure.Property(Name, Attribute) Then
		Return Value;
	EndIf;
	
	If Attribute.IsUnload Then
		Return UnloadIdentificators.GetFieldValue(RowStructure, Name, Period);
	ElsIf Attribute.IsCalculation Then
		CurrentStructure = Server.GetRegisterDimensions(CounterpartyData);
		FillPropertyValues(CurrentStructure, RowStructure);
		Return CounterpartyData.Get(Period, CurrentStructure)[Name];		
	Else
		Return ObjectProperties.GetFieldValue(RowStructure, Name, Period);
	EndIf;
	
EndFunction // GetFieldValue()

Function AddListRow(RowStructure, Period, Clone) Export
	
	// import
	Economic = ChartsOfAccounts.velpo_Economic;
	CounterpartyData = InformationRegisters.velpo_CounterpartyData;
	Server = velpo_Server;
		
	// vars
	RowStructure.Account = Economic.Counterparties;
	AccountStructure = Economic.GetAccountData(RowStructure.Account);
	
	Record = Server.CreateListRow(CounterpartyData, RowStructure, Period, Clone);
	If Clone Then
		Record.ObjectID = AccountStructure.ObjectID.ValueType.AdjustValue(Undefined);
	EndIf;
	Record.ObjectType = AccountStructure.ObjectID.Ref;
	Record.Status = 0;
	Record.Write(False);
			
	Return Record;
	
EndFunction // AddListRow(RowStructure, Period, Clone)

Procedure SetFieldValue(RowStructure, Name, Period, Value) Export
	
	 // import
	Economic = ChartsOfAccounts.velpo_Economic;
	CounterpartyData = InformationRegisters.velpo_CounterpartyData;
	ObjectProperties = InformationRegisters.velpo_ObjectProperties;
	UnloadIdentificators = InformationRegisters.velpo_UnloadIdentificators;
	Server = velpo_Server; 
	
	// vars
	AccountStructure = Economic.GetAccountData(RowStructure.Account);
	Attribute = Undefined;
	
	If Not AccountStructure.Property(Name, Attribute) Then
		Return;
	EndIf;
	
	If Attribute.IsUnload Then
		UnloadIdentificators.SetFieldValue(RowStructure, Name, Period, Value);
	ElsIf Attribute.IsCalculation Or RowStructure.Property(Name) Then
		Server.ChangeListRow(CounterpartyData, RowStructure, Name, Period, Value);
	Else
		ObjectProperties.SetFieldValue(RowStructure, Name, Period, Value);
	EndIf;
	
EndProcedure

Procedure SetDynamicList(List) Export
	
	// import
	Cache = velpo_ServerCache;
	Economic = ChartsOfAccounts.velpo_Economic;
	Common = velpo_CommonFunctions;
	RiskCalculations = DataProcessors.velpo_RiskCalculations;

	// vars
	AccountStructure = Economic.GetAccountData(Economic.Counterparties);
	
	ListProperties = Common.DynamicListPropertiesStructure();
	ListProperties.MainTable = "InformationRegister.velpo_CounterpartyData";
	ListProperties.DynamicDataRead = True;
	ListProperties.QueryText = GetQueryText(AccountStructure);
	
	Common.SetDynamicListProperties(List, ListProperties);
	
	RiskCalculations.AddDynamicListColumns(List, AccountStructure, AccountStructure.Properties);

EndProcedure

#EndIf
